In [15]:
import pandas as pd

In [16]:
variable=pd.read_csv(r"C:\Users\tahuj\Desktop\airline-safety.csv")

In [17]:
variable.head()

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

In [32]:
df=pd.DataFrame({'ID':[100,101,102],'NAME':["Ashish","Manish","Somesh"],'COLOR':['Yellow','Blue','Green']},columns=["ID","NAME","COLOR"],index=['1','2','3'])

In [33]:
df

    ID    NAME   COLOR
1  100  Ashish  Yellow
2  101  Manish    Blue
3  102  Somesh   Green

In [37]:
df.head(3)

    ID    NAME   COLOR
1  100  Ashish  Yellow
2  101  Manish    Blue
3  102  Somesh   Green

In [58]:
variable.loc[0:34,['fatal_accidents_85_99','fatalities_85_99','fatalities_00_14']]

    fatal_accidents_85_99  fatalities_85_99  fatalities_00_14
0                       0                 0                 0
1                      14               128                88
2                       0                 0                 0
3                       1                64                 0
4                       0                 0                 0
5                       4                79               337
6                       1               329               158
7                       0                 0                 7
8                       0                 0                88
9                       2                50                 0
10                      1                 1                 0
11                      5               101               416
12                      0                 0                 0
13                      3               323                 0
14                      0                 0                 0
15                      0                 0                 0
16                      6               535               225
17                      1                16                 0
18                      1                47                 0
19                     12               407                51
20                      3               282                14
21                      1                 4                 0
22                      5               167                92
23                      0                 0                 0
24                      3               260                22
25                      0                 0               143
26                      0                 0                 0
27                      1               148                 0
28                      1               520                 0
29                      0                 0               283
30                      1                 3                 0
31                      5               425                 0
32                      2                21                 0
33                      1                 2                 0
34                      1                34               537